Revit.Elements.Views.FloorPlanView
A Revit ViewPlan

Revit.Elements.Views.FloorPlanView.#ctor(Autodesk.Revit.DB.ViewPlan)
Private constructor

Revit.Elements.Views.FloorPlanView.#ctor(Autodesk.Revit.DB.Level)
Private constructor

Revit.Elements.Views.FloorPlanView.InitFloorPlanView(Autodesk.Revit.DB.ViewPlan)
Initialize a FloorPlanView element

Revit.Elements.Views.FloorPlanView.InitFloorPlanView(Autodesk.Revit.DB.Level)
Initialize a FloorPlanView element

Revit.Elements.Views.FloorPlanView.ByLevel(Revit.Elements.Level)
Create a Revit Floor Plan at a given Level
level:
Returns:

Revit.Elements.Views.FloorPlanView.FromExisting(Autodesk.Revit.DB.ViewPlan,System.Boolean)
Create from existing Element
plan:
isRevitOwned:
Returns: